Feature: Вход в системата
 


  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Въведе валидно потребителско име
    And въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за успех.

  Scenario: Вход в системата без парола
    Given Потребителя отваря екрана за вход в системата
    When Въведе валидно потребителско име
    And натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни.
    
  Scenario: Вход в системата без потребителско име
    Given Потребителя отваря екрана за вход в системата
    When въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни.
    
	Scenario: Вход в системата без потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни.
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Въведе невалидно потребителско име
    And въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение грешни данни.    
 